balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F2012E.PIC
      <edc:DCRDef edc:access="--nn--nn----nnnn" edc:cname="RESERVED2" edc:default="0xffff" edc:desc="" edc:impl="0x330f" edc:name="RESERVED2" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x330f">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="RES3" edc:desc="Reserved" edc:ishidden="true" edc:mask="0xf" edc:name="RES3" edc:nzwidth="0x4">
              <edc:DCRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0xf) == 0xf"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="4"/>
            <edc:DCRFieldDef edc:cname="RES2" edc:desc="Reserved" edc:ishidden="true" edc:mask="0x3" edc:name="RES2" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:DCRFieldDef edc:cname="RES1" edc:desc="Reserved" edc:ishidden="true" edc:mask="0x3" edc:name="RES1" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="-------------nnn" edc:cname="FGS" edc:default="0xffff" edc:desc="" edc:impl="0x7" edc:name="FGS" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0x7">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="GWRP" edc:desc="General Code Segment Write Protect" edc:mask="0x1" edc:name="GWRP" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="GWRP_OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="GWRP_OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="GWRP_ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="GWRP_ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="GCP" edc:desc="General Segment Code Protection" edc:mask="0x3" edc:name="GCP" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="CODE_PROT_OFF" edc:desc="Disabled" edc:when="(field &amp; 0x3) == 0x3">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="CODE_PROT_OFF"/>
                </edc:AliasList>
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x0" edc:endaddr="0x0"/>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="CODE_PROT_ON" edc:desc="Enabled" edc:when="(field &amp; 0x3) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="CODE_PROT_ON"/>
                </edc:AliasList>
                <edc:Checksum edc:beginaddr="0x0" edc:checksumalgo="0x27" edc:endaddr="0x2000"/>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nn------------nn" edc:cname="FICD" edc:default="0xffff" edc:desc="" edc:impl="0xc003" edc:name="FICD" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x4000" edc:useinchecksum="0xc003">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="ICS" edc:desc="Comm Channel Select" edc:mask="0x3" edc:name="ICS" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="ICS_PGD" edc:desc="Use PGC/EMUC and PGD/EMUD" edc:when="(field &amp; 0x3) == 0x3">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="ICS_PGD"/>
                  <edc:LegacyAlias edc:cname="PGD"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ICS_PGD1" edc:desc="Use EMUC1 and EMUD1" edc:when="(field &amp; 0x3) == 0x2">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="ICS_PGD1"/>
                  <edc:LegacyAlias edc:cname="PGD1"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ICS_PGD2" edc:desc="Use EMUC2 and EMUD2" edc:when="(field &amp; 0x3) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="ICS_PGD2"/>
                  <edc:LegacyAlias edc:cname="PGD2"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ICS_PGD3" edc:desc="Use EMUC3 and EMUD3" edc:when="(field &amp; 0x3) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="ICS_PGD3"/>
                  <edc:LegacyAlias edc:cname="PGD3"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="12"/>
            <edc:DCRFieldDef edc:cname="COE" edc:desc="Set Clip On Emulation Mode" edc:ishidden="true" edc:mask="0x1" edc:name="COE" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Reset Into Operational Mode" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Reset Into Clip On Emulation Mode" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BACKBUG" edc:desc="Background Debug" edc:ishidden="true" edc:mask="0x1" edc:name="BACKBUG" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Disabled" edc:when="(field &amp; 0x1) == 0x1">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="OFF"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0">
                <edc:AliasList>
                  <edc:LegacyAlias edc:cname="ON"/>
                </edc:AliasList>
              </edc:DCRFieldSemantic>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:DeviceIDSector edc:beginaddr="0xff0000" edc:endaddr="0xff0004" edc:mask="0xffff0000" edc:regionid="devid" edc:value="0xc20000">
      <edc:DEVIDToRev edc:revlist="ms2 a0" edc:value="0xc21000"/>
      <edc:DEVIDToRev edc:revlist="ms1 a0" edc:value="0x2411000"/>
    </edc:DeviceIDSector>
    <edc:BACKBUGVectorSector edc:beginaddr="0x800000" edc:endaddr="0x800008" edc:regionid="debug"/>
  </edc:ProgramSpace>
  <edc:DataSpace edc:xbeginaddr="0x1600" edc:xendaddr="0x1a00" edc:ybeginaddr="0x1800">
    <edc:RegardlessOfMode>
      <edc:SFRDataSector edc:beginaddr="0x0" edc:endaddr="0x800" edc:regionid="sfrs">
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="WREG0" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="WREG0" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG0" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="WREG0" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:cname="WREG1" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="WREG1" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WREG1" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="WREG1" edc:nzwidth="0x10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Integer"/>
        </edc:SFRDef>
